In [6]:
import os
print(os.getcwd())

C:\Users\Hp\Datahut-QA-Assignment\Notebooks

In [4]:
import pandas as pd

df = pd.read_csv('../data/cleaned_dataset.csv')  # or use messy_Data.csv if you're still cleaning

In [2]:
import pandas as pd
df = pd.read_csv('../data/messy_Data.csv')  # Adjust path if needed

# Preview the data
print("Dataset shape:", df.shape)
df.head()

Dataset shape: (11000, 8)

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
0,0,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25.0,xlopez@hotmail.com,NaN,88552.0,Sales
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,NaN
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
4,4,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71.0,figueroakayla@yahoo.com,NaN,143456.0,Marketing

In [3]:
# Null values
print("Missing values per column:")
print(df.isnull().sum())

# Duplicates
print("\nDuplicate rows:")
print(df.duplicated().sum())

# Check email issues
print("\nInvalid emails:")
invalid_emails = df[~df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]
display(invalid_emails)

# Check department typos
print("\nUnique departments:")
print(df['Department'].unique())

# Check noisy name field
df['Name'].sample(10)

Missing values per column:
Unnamed: 0       0
ID               0
Name          2333
Age           1747
Email         1269
Join Date     2192
Salary        2239
Department    2255
dtype: int64

Duplicate rows:
291

Invalid emails:

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,NaN
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,17/09/2020,77311.0,HR
7,7,465e625b-f924-4061-8356-c7e3130f7118,Derek Murphy,38.0,josephrobertsongmail.com,2021-01-12,NaN,Support
...,...,...,...,...,...,...,...,...
10978,3054,1ea7f125-698d-49dc-a97a-955b4dc4fc9b,NaN,NaN,NaN,NaN,NaN,NaN
10988,6403,4edd1e6e-cfb5-4300-9c74-e9642836e134,NaN,NaN,NaN,NaN,NaN,NaN
10993,9510,796f8c0b-15a4-475c-bb02-ac892df0c746,Shelley Hopkinslive,79.0,Michael Walker,25/12/1992,47809.0,HR
10995,6523,07c223be-03e6-4f70-a2b5-86df778cc61a,NaN,NaN,NaN,NaN,NaN,NaN
10996,9785,da8a6bbc-5026-4630-848d-f64e80dac56c,Steven Armstrong,38.0,molly89gmail.com,2021-06-24,NaN,Sales

Unique departments:
['Sales' nan 'Engineering' 'SupportJ' 'Marketing' 'SupportE' 'HR'
 'Support' 'HRC' 'SalesA' 'SalesX' 'Supportu' 'Engineeringi' 'MarketingR'
 'Salesw' 'SalesK' 'MarketingU' 'Salesi' 'HRa' 'SalesG' 'Supporty'
 'SalesN' 'Marketinge' 'Marketingv' 'HRv' 'SalesM' 'EngineeringL'
 'MarketingQ' 'HRs' 'SalesW' 'Supportj' 'Salesd' 'Marketingu'
 'Engineeringj' 'SalesU' 'HRO' 'MarketingH' 'Salesj' 'Saleso' 'SalesZ'
 'Engineeringe' 'MarketingF' 'Marketingr' 'Engineeringm' 'HRW' 'HRt' 'HRz'
 'Engineeringp' 'HRF' 'EngineeringS' 'SupportW' 'EngineeringT' 'SalesC'
 'SalesB' 'SupportC' 'SalesY' 'Marketingn' 'EngineeringK' 'Marketingz'
 'HRo' 'SupportB' 'HRi' 'Salest' 'Supportg' 'Supporta' 'HRn' 'SupportQ'
 'Salesr' 'EngineeringG' 'Supportm' 'Supporto' 'EngineeringH' 'Marketingw'
 'EngineeringM' 'Supportz' 'HRr' 'Salesy' 'MarketingD' 'HRE' 'Marketingm'
 'HRw' 'Marketingo' 'Supportk' 'MarketingN' 'SupportS' 'EngineeringD'
 'Marketingp' 'Salesl' 'MarketingI' 'MarketingL' 'SupportT' 'Engineeringn'
 'MarketingO' 'SalesF' 'Salesz' 'Marketingt' 'Engineeringv' 'HRL' 'HRI'
 'EngineeringR' 'HRD' 'Marketingk' 'HRQ' 'Salese' 'Saless' 'Marketingi'
 'Salesn' 'Engineeringl' 'SalesE' 'HRy' 'EngineeringE' 'SalesD' 'HRm'
 'Engineerings' 'SupportF' 'Marketingy' 'MarketingG' 'SalesI' 'Salesu'
 'Engineeringg' 'EngineeringQ' 'MarketingE' 'SupportA' 'Engineeringq'
 'EngineeringA' 'Supporte' 'Engineeringu' 'EngineeringO' 'SalesS'
 'Supportv' 'HRK' 'Engineeringb' 'SalesV' 'HRT' 'SupportY' 'SalesQ'
 'MarketingX' 'Supportp' 'Marketingf' 'HRU' 'HRp' 'Salesq' 'HRg'
 'Marketingl' 'EngineeringV' 'Engineeringt' 'SupportO' 'SalesJ'
 'EngineeringX' 'Engineeringc' 'Marketingh' 'EngineeringC' 'Engineeringz'
 'HRP' 'Salesv' 'Engineeringk' 'SupportH' 'Salesk' 'Supporth' 'SupportZ'
 'Supportq' 'Supportr' 'HRJ' 'Supportd' 'HRZ' 'MarketingZ' 'Salesc'
 'EngineeringJ' 'Engineeringx' 'SalesR' 'Engineeringh' 'Supportl'
 'SupportX' 'Marketingg' 'SalesH' 'MarketingC' 'SupportV' 'HRq'
 'Marketingb' 'Supporti' 'Supportw' 'SupportL' 'Marketings' 'Marketingq'
 'HRM' 'Supportt' 'HRX' 'HRl' 'EngineeringF' 'SupportP' 'HRf' 'MarketingB'
 'Engineeringf' 'EngineeringW' 'HRB' 'Engineeringy' 'Marketinga' 'HRj'
 'HRd' 'SupportI' 'HRA' 'Marketingj' 'MarketingV' 'EngineeringI' 'HRY'
 'EngineeringZ' 'MarketingY' 'Marketingx' 'HRH' 'HRN' 'MarketingJ'
 'MarketingW' 'HRh' 'Supportb' 'SalesT' 'Supportn' 'Engineeringa'
 'SupportG' 'SalesO' 'SupportK' 'Engineeringd' 'HRk' 'Marketingd'
 'MarketingS' 'MarketingT' 'HRR' 'Engineeringw' 'Salesg' 'HRb' 'SupportN'
 'Marketingc' 'EngineeringU' 'Supportx' 'Salesp' 'HRu' 'MarketingK'
 'SalesL' 'Salesx' 'SupportD' 'Supports' 'Salesm' 'Engineeringr' 'HRe'
 'SupportM' 'MarketingM' 'SupportR' 'SupportU' 'Salesa' 'Salesf'
 'Supportf' 'Salesh' 'Salesb' 'EngineeringB' 'HRG' 'Engineeringo'
 'EngineeringN' 'HRV' 'HRS' 'SalesP' 'Supportc' 'HRx' 'EngineeringP' 'HRc'
 'MarketingP' 'MarketingA']

6918      Tracey Richardstoo
2548                     NaN
6501           Tristan Davis
6694             Nathan Ross
2398          John Chanready
6206     Joshua Anderson DDS
978                      NaN
10639                    NaN
4369          Cynthia Garcia
5429           Nicole Chavez
Name: Name, dtype: object

In [4]:
# Check for missing IDs
print("Missing IDs:", df['ID'].isnull().sum())

# Check for duplicate IDs
print("Duplicate IDs:", df['ID'].duplicated().sum())

Missing IDs: 0
Duplicate IDs: 1000

In [7]:
# Check age range
df['Age'].describe()

# Show extreme ages
df[(df['Age'] < 15) | (df['Age'] > 100)]

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [16]:
# Keep only rows where Age is less than or equal to 65
df = df[df['Age'] <= 65]

In [8]:
df['Age'].dtype

dtype('float64')

In [9]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [10]:
df['Age'].describe()

count    9253.000000
mean       54.162650
std        21.072919
min        18.000000
25%        36.000000
50%        54.000000
75%        72.000000
max        90.000000
Name: Age, dtype: float64

In [11]:
df[(df['Age'] < 15) | (df['Age'] > 100)]

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [12]:
df = df[(df['Age'] >= 15) & (df['Age'] <= 100)]

In [14]:
# Emails that do NOT match the standard format
invalid_emails = df[~df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]
print("Invalid emails:", invalid_emails.shape[0])
invalid_emails.head()

Invalid emails: 2309

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,NaN
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,17/09/2020,77311.0,HR
7,7,465e625b-f924-4061-8356-c7e3130f7118,Derek Murphy,38.0,josephrobertsongmail.com,2021-01-12,NaN,Support

In [15]:
# Check for personal emails
personal_emails = df[df['Email'].str.contains(r'gmail|yahoo|hotmail|rediff', case=False, na=False)]
print("Personal emails:", personal_emails.shape[0])
personal_emails.head()

Personal emails: 4437

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
0,0,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25.0,xlopez@hotmail.com,NaN,88552.0,Sales
4,4,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71.0,figueroakayla@yahoo.com,NaN,143456.0,Marketing
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,17/09/2020,77311.0,HR
7,7,465e625b-f924-4061-8356-c7e3130f7118,Derek Murphy,38.0,josephrobertsongmail.com,2021-01-12,NaN,Support
8,8,12cc2f16-d641-402e-b22b-3332bafc4f1d,NaN,71.0,andrew74@hotmail.com,2022-02-12,83354.0,Sales

In [16]:
# Check unique department names
print("Unique department names:\n", df['Department'].unique())

Unique department names:
 ['Sales' nan 'Engineering' 'SupportJ' 'Marketing' 'SupportE' 'HR'
 'Support' 'HRC' 'SalesA' 'Engineeringi' 'MarketingR' 'SalesX' 'Salesw'
 'SalesK' 'MarketingU' 'Salesi' 'HRa' 'SalesG' 'Supporty' 'SalesN'
 'Marketinge' 'Marketingv' 'HRv' 'SalesM' 'EngineeringL' 'MarketingQ'
 'HRs' 'SalesW' 'Supportj' 'Salesd' 'Engineeringj' 'SalesU' 'HRO'
 'MarketingH' 'Salesj' 'Saleso' 'SalesZ' 'Engineeringe' 'Marketingr'
 'Engineeringm' 'HRW' 'HRz' 'Engineeringp' 'EngineeringS' 'SupportW'
 'EngineeringT' 'SalesC' 'SalesB' 'SalesY' 'Marketingn' 'EngineeringK'
 'Marketingz' 'HRo' 'SupportB' 'HRi' 'Salest' 'Supportg' 'Supporta' 'HRn'
 'SupportQ' 'EngineeringG' 'SupportC' 'Supportm' 'Supporto' 'EngineeringH'
 'Marketingw' 'EngineeringM' 'Supportz' 'HRr' 'Salesy' 'MarketingD' 'HRE'
 'Supportu' 'Marketingm' 'HRw' 'Marketingo' 'Supportk' 'MarketingN'
 'SupportS' 'EngineeringD' 'MarketingI' 'MarketingL' 'Salesr' 'SupportT'
 'Engineeringn' 'MarketingO' 'SalesF' 'Salesz' 'Marketingt' 'Engineeringv'
 'HRL' 'HRI' 'EngineeringR' 'HRD' 'HRQ' 'Salese' 'Saless' 'Marketingi'
 'Salesn' 'Engineeringl' 'SalesE' 'HRy' 'EngineeringE' 'SalesD' 'HRm'
 'Engineerings' 'SupportF' 'Marketingy' 'MarketingG' 'SalesI'
 'Engineeringg' 'EngineeringQ' 'MarketingE' 'Marketingk' 'SupportA'
 'Engineeringq' 'EngineeringA' 'Supporte' 'Engineeringu' 'EngineeringO'
 'SalesS' 'Supportv' 'HRK' 'Engineeringb' 'SalesV' 'HRT' 'SupportY'
 'SalesQ' 'MarketingX' 'Supportp' 'Marketingf' 'HRU' 'HRp' 'Salesq' 'HRg'
 'Marketingl' 'EngineeringV' 'Engineeringt' 'SupportO' 'SalesJ'
 'EngineeringX' 'Engineeringc' 'Marketingh' 'MarketingF' 'EngineeringC'
 'Engineeringz' 'HRP' 'Salesv' 'Engineeringk' 'SupportH' 'Salesk'
 'Supporth' 'SupportZ' 'Supportq' 'Supportr' 'HRJ' 'Supportd' 'HRZ'
 'MarketingZ' 'Salesc' 'EngineeringJ' 'Engineeringx' 'Engineeringh'
 'Supportl' 'SupportX' 'Marketingg' 'SalesH' 'MarketingC' 'SupportV' 'HRq'
 'Marketingb' 'Supporti' 'Supportw' 'SupportL' 'Marketings' 'Marketingq'
 'HRM' 'Supportt' 'HRX' 'HRl' 'EngineeringF' 'SupportP' 'HRf' 'MarketingB'
 'Engineeringf' 'EngineeringW' 'HRB' 'Engineeringy' 'Marketinga' 'HRd'
 'SupportI' 'HRA' 'Marketingj' 'EngineeringI' 'HRY' 'EngineeringZ'
 'MarketingY' 'MarketingV' 'Marketingx' 'HRH' 'HRN' 'MarketingJ'
 'MarketingW' 'HRh' 'Supportb' 'SalesT' 'Supportn' 'Engineeringa' 'Salesl'
 'SupportG' 'SalesO' 'SalesR' 'SupportK' 'Engineeringd' 'HRk' 'Marketingd'
 'MarketingS' 'MarketingT' 'HRR' 'Engineeringw' 'Salesg' 'HRj' 'HRb'
 'SupportN' 'Marketingc' 'EngineeringU' 'Supportx' 'Salesp' 'HRu'
 'MarketingK' 'SalesL' 'Salesx' 'Marketingu' 'SupportD' 'Salesu' 'Salesm'
 'Engineeringr' 'HRe' 'SupportM' 'MarketingM' 'SupportR' 'SupportU' 'HRF'
 'Salesa' 'Salesf' 'Supportf' 'Salesb' 'EngineeringB' 'HRG' 'Engineeringo'
 'EngineeringN' 'HRV' 'Salesh' 'HRS' 'SalesP' 'Supportc' 'HRx' 'HRt'
 'Supports' 'Marketingp' 'EngineeringP' 'HRc' 'MarketingP' 'MarketingA']

In [18]:
# Remove symbols first (if needed)
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Check range
print("Salary Stats:\n", df['Salary'].describe())

# Check extreme high salaries
df[df['Salary'] > 300000].head()

# Check zero or very low salaries
df[df['Salary'] < 1000].head()

Salary Stats:
 count      8327.000000
mean      89849.883704
std       34794.627315
min       24655.136613
25%       59924.000000
50%       89245.000000
75%      119421.500000
max      176156.206747
Name: Salary, dtype: float64

Empty DataFrame
Columns: [Unnamed: 0, ID, Name, Age, Email, Join Date, Salary, Department]
Index: []

In [19]:
# Names with special characters
df[df['Name'].str.contains(r'[^a-zA-Z\s]', na=False)].head()

# Unusually long names
df[df['Name'].str.len() > 30].head()

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
5343,5343,fdd4537d-5be3-42e3-ab2d-5bdfaf68eac8,Mrs. Jacqueline Davis DVMparent,78.0,dennis09smith.com,2021-11-03,107196.000000,Marketing
7829,7829,d45b44ae-b0d7-4899-9bb7-ae797b00f8ab,Dr. Clifford Carrillo IIpopular,18.0,charles26@rivera-meyer.com,11/07/2011,152321.214592,Support
9936,9936,6dcfb2c6-9a39-4a55-82a7-5f5b39138e7d,Mrs. Tiffany Malone MDknowledge,87.0,qjones@lynch-cooley.com,2021-07-12,NaN,NaN

In [20]:
df = df.drop_duplicates(subset='ID', keep='first')

In [22]:

df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

df = df[(df['Age'] >= 15) & (df['Age'] <= 100)]

In [23]:
df = df[df['Email'].str.contains(r'^[\w\.-]+@[\w\.-]+\.\w+$', na=False)]
df = df[~df['Email'].str.contains('gmail|yahoo|hotmail|rediff', case=False, na=False)]

In [24]:
# Fix typos
df['Department'] = df['Department'].replace({
    'Hr': 'HR',
    'Engneering': 'Engineering',
    'Marketng': 'Marketing',
    'Saless': 'Sales',
    'Supporrt': 'Support',
    'SupportJ': 'Support'
})

# Optional: Replace missing departments
df['Department'] = df['Department'].fillna('Unknown')

In [25]:
# Remove numbers/symbols and standardize case
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)
df['Name'] = df['Name'].str.strip().str.title()

In [27]:
# Convert to numeric if needed
df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

# Remove unrealistic salaries
df = df[(df['Salary'] >= 1000) & (df['Salary'] <= 300000)]

In [28]:
df.to_csv('../data/cleaned_dataset.csv', index=False)

In [7]:
# Check for missing, empty, or whitespace-only names
blank_names = df[df['Name'].isnull() | (df['Name'].str.strip() == "")]
print("Total blank or missing names:", blank_names.shape[0])
blank_names.head()

Total blank or missing names: 58

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
15,350,8b2948a1-3021-47f9-8ab1-34624240a528,NaN,72.0,drodriguez@phillips.com,2007-09-15,134658.000000,Sales
18,405,e112f1a1-9650-4e2d-8c07-96ebdb772f59,NaN,23.0,victor40@padilla.biz,2000-04-24,133652.000000,Unknown
36,717,4bd1a235-725c-4cc7-a857-645f484ca97c,NaN,85.0,megan15@goodwin.biz,1994-01-11,116906.000000,Salesy
61,1169,8207838c-ec54-4bcc-8061-56757823b81c,NaN,61.0,christinafarrell@kelly.com,1992-06-23,104076.314257,MarketingH
81,1572,226423a4-0ceb-4ec2-bb96-4bfa82f1d8aa,NaN,48.0,gtodd@morgan.com,2022-12-04,94071.592967,Unknown

In [8]:
# Remove rows with blank or missing names
df = df[df['Name'].notnull()]                     # Remove NaN
df = df[df['Name'].str.strip() != ""]             # Remove empty or whitespace

In [9]:
# Remove symbols and apply title case
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)
df['Name'] = df['Name'].str.strip().str.title()

In [10]:
df['Name'].head(20)

0                  Lisa Bailey
1              Nicole Cardenas
2                  Laura Davis
3               Jason Stephens
4              Richard Estrada
5           Mr Larry Mcpherson
6                Richard Brown
7                Kristen Moyer
8                 Alice Medina
9                 Rodney Burns
10         Brandi Fowlerreport
11    Jeremiah Parkereverybody
12                 Michael Fox
13                 Adam Howell
14                 Mary Lawson
16         Susan Henderson Dds
17               Daniel Bender
19                John Miranda
20            Lindsey Mccoybad
21         Mitchell Jamescarry
Name: Name, dtype: object

In [11]:
# Replace NaN (missing) and empty/whitespace names with 'Unknown'
df['Name'] = df['Name'].fillna('Unknown')
df['Name'] = df['Name'].apply(lambda x: 'Unknown' if str(x).strip() == '' else x)

In [12]:
# Clean and standardize names
df['Name'] = df['Name'].str.replace(r'[^a-zA-Z\s]', '', regex=True)
df['Name'] = df['Name'].str.strip().str.title()

In [13]:

df['Name'].value_counts().head(25)

Name
Melissa Brown               2
Nicole Cardenas             1
Nicole Bryant               1
Alexis Peters               1
Amber Stewart               1
Nicholas Woodward           1
Thomas Hamptoneasy          1
Richard Hawkins             1
Carlos Kline                1
Erik Sanchezname            1
Shawn Villegas Md           1
Robin White                 1
Glen Lee                    1
Chloe Rosario               1
David Hernandez             1
Elizabeth Williamsonidea    1
Karen Alexandermemory       1
Lisa Bailey                 1
John Miranda                1
Lindsey Mccoybad            1
Mitchell Jamescarry         1
Yolanda Cherry              1
Andrew Fuller               1
Amber Bailey Dvm            1
Angel Anderson              1
Name: count, dtype: int64

In [14]:
# Save cleaned data
df.to_csv('../data/cleaned_dataset.csv', index=False)

print("Cleaned file saved to ../data/cleaned_dataset.csv")

Cleaned file saved to ../data/cleaned_dataset.csv

In [15]:
# Convert Age column to numeric (if not already)
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [17]:
# Check maximum age now
df['Age'].max()

np.float64(65.0)

In [18]:
# Keep only rows where Age is less than or equal to 65
df = df[df['Age'] <= 60]

In [19]:
df = df.dropna(subset=['Age'])

In [20]:
df['Age'].max()

np.float64(60.0)

In [21]:
# Save cleaned data
df.to_csv('../data/cleaned_dataset.csv', index=False)

print("Cleaned file saved to ../data/cleaned_dataset.csv")

Cleaned file saved to ../data/cleaned_dataset.csv

In [22]:
df.to_csv('../data/cleaned_dataset.csv', index=False)